app/views/profiles/_information_mobile.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 ORDER BY "profiles"."id" ASC LIMIT 1  [["id", 1]]
---
    <li><span class="glyphicon glyphicon-stats">  </span> <%= label_tag t('activemodel.activerecord.attributes.profile.level').html_safe %>: easy</li>
    <li><span class="glyphicon glyphicon-picture">  </span> <%= label_tag t('activemodel.activerecord.attributes.profile.photos').html_safe %>: <%= @photos.count %></li>