app/views/profiles/_search_result.html.erb

SELECT "users".* FROM "users" WHERE "users"."profile_id" = $1 ORDER BY "users"."id" ASC LIMIT 1  [["profile_id", 1]]
---
<% @search_box.each do |profile| %>
    <li ><%= link_to raw("#{image_tag profile.avatar.url(:small), class: "img-circle " , width: "35" , height: "35"} #{profile.firstname} #{profile.lastname}<br /><span>#{profile.user.email}</span>"),profile ,style: 'color: #808394'%></li>