app/controllers/profiles_controller.rb

  def index
    if(!params[:search_layout].blank?)
      @search_box = Profile.search(params[:search_layout],:page => params[:page], :per_page => 5 )
---
SELECT "profiles".* FROM "profiles" WHERE (1 = 0)

  def show
    if params[:page].nil?
          @message = Message.new
          conditions = { user_id: current_user.id,
                         request_to_id: @profile.user.id }
          @request_friendship = RequestFriendship.find(:first , :conditions => conditions)
          conditions = { user_id: current_user.id,
              friend_id: @profile.user.id }
          @friendship = Friendship.find(:first , :conditions => conditions)
          @optionsProfile = []
          @optionsProfile.push( Workout.where(:user_id => @profile.user.id).sum(:total_min))
          @optionsProfile.push( Workout.where(:user_id => @profile.user.id).sum(:total_cal))

      end
      @photos = @profile.photo_events.order( 'created_at DESC' ).paginate(:page => params[:page], :per_page => 3)
---
SELECT SUM(`workouts`.`total_min`) AS sum_id FROM `workouts` WHERE `workouts`.`user_id` = 6
SELECT SUM(`workouts`.`total_cal`) AS sum_id FROM `workouts` WHERE `workouts`.`user_id` = 6
SELECT COUNT(*) FROM "photo_events" WHERE "photo_events"."profile_id" = $1  [["profile_id", 1]]
SELECT `photo_events`.* FROM `photo_events` WHERE `photo_events`.`profile_id` = 5 ORDER BY created_at DESC LIMIT 3 OFFSET 0

  def create
    @profile = Profile.new(profile_params)
    @aux_prof = AuxilaryProfile.new
    @photo_event = PhotoEvent.new
    respond_to do |format|
      if @profile.save
        @aux_prof.weight = @profile.weight
        @aux_prof.height = @profile.height
        @aux_prof.profile_id = @profile.id
        @aux_prof.save
        format.html { redirect_to @profile, notice: "#{t 'other.create_success'}"}
        format.json { render action: 'show', status: :created, location: @profile }
      else
        format.html { render action: 'new' }
        format.json { render json: @profile.errors, status: :unprocessable_entity }
      end
      current_user.profile = @profile
      current_user.save
---
INSERT INTO "profiles" ("birthdate", "city", "country", "created_at", "firstname", "height", "language", "lastname", "updated_at", "weight") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
INSERT INTO "auxilary_profiles" ("created_at", "height", "profile_id", "updated_at", "weight") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 28 May 2014 14:24:05 UTC +00:00], ["height", 190], ["profile_id", 1], ["updated_at", Wed, 28 May 2014 14:24:05 UTC +00:00], ["weight", 79]]
UPDATE "users" SET "profile_id" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["profile_id", 1], ["updated_at", Wed, 28 May 2014 14:24:05 UTC +00:00]]

  def update

    respond_to do |format|
      if @profile.update(profile_params)

        @aux_prof = AuxilaryProfile.new
        @aux_prof.weight = @profile.weight
        @aux_prof.height = @profile.height
        @aux_prof.profile_id = @profile.id
        @aux_prof.save
---
UPDATE `profiles` SET `language` = 'fa', `updated_at` = '2014-05-28 06:27:41' WHERE `profiles`.`id` = 5
INSERT INTO `auxilary_profiles` (`created_at`, `height`, `profile_id`, `updated_at`, `weight`) VALUES ('2014-05-28 06:27:41', 190, 5, '2014-05-28 06:27:41', 79)

    def set_profile
      @profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 ORDER BY "profiles"."id" ASC LIMIT 1  [["id", 1]]